MusicApp/app/controllers/users_controller.rb

UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "ABAKTLKRBjqGg4nHQD-ylQ"], ["id", 1]]
---
  def create
    @user = User.find_by_credentials(params[:user][:email], params[:user][:password])

    if @user.save