MusicApp/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)


    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", "tylerthomasallen@gmail.com"], ["password_digest", "$2a$10$iS2ooDWjK47qnDh8HPM1AOhGrJLolSKkbjcFS61tM7K0VkaeKRPkO"], ["session_token", "NJ6CKWPXKfGtVWMf_cDCTA"]]