MusicApp/app/models/user.rb

  def self.find_by_credentials(email, pw)
    user = User.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "tyler"], ["LIMIT", 1]]

  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64
    self.save!
---
UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "ABAKTLKRBjqGg4nHQD-ylQ"], ["id", 1]]